# Задача 3: Лог-сообщение
# Создай "лог-сообщение" в формате:
# [INFO] 2025-11-16 10:30:45 — Пользователь 'anna' выполнил вход.
# Где:

# [INFO] — уровень лога
# дата и время — текущие (используй datetime.datetime.now())
# 'anna' — имя пользователя (вводит пользователь)
# 💡 Подсказка:
# from datetime import datetime
# now = datetime.now().strftime("%Y-%m-%d %H:%M:%S")
from datetime import datetime

username = input("Введите имя пользователя: ").strip() or "guest"
# .strip() — убрать пробелы по краям
# or "guest" — если ввели пусто, будет "guest"

now = datetime.now().strftime("%Y-%m-%d %H:%M:%S")

print(f"[INFO] {now} - Пользователь {username} выполнил вход.")
