

def call_calculate():
    male = input("Какой ваш пол? Женщина/ Мужчина: ").strip()
    if male.lower() not in ('женщина', 'женский', 'мужской', 'мужчина'):
        print("Такого я не знаю 🤷")
        exit()
    if not male:
        print("⛔ Вы не ввели значение!")
        exit()
    hight = input("Введите ваш рост (в сантиметрах)📏: ").strip()
    if not hight.isdigit():
        print("⛔ Вы не ввели значение!")
        exit()
    if not hight:
        print("Для подсчета мне нужен ваш рост")
        exit()
    wight = input("Введите ваш вес (в кг)⚖️: ").strip()
    if not wight.isdigit():
        print("⛔ Вы не ввели значение!")
        exit()
    elif not wight:
        print("Для подсчета мне нужен ваш вес")
        exit()
    years = input("Введите ваш возраст (полных лет): ").strip()
    if not years.isdigit():
        print("⛔ Вы не ввели значение!")
        exit()
    elif not years:
        print("Для подсчета мне нужен ваш возраст")
        exit()
    if male.lower() in ('женщина', 'женский', 'ж'):
        return 447.60 + (9.20 * int(wight)) + (3.10 * int(hight) - (4.30 * int(years)))
    elif male.lower() in ('мужской', 'мужчина', 'м'):
        return 88.36 + (13.40 * int(wight)) + (4.80 * int(hight)) - (5.70 * int(years))


print("Ваша норма каллорий составляет - ", call_calculate(), "Ккал в день")
