# Задача 1: Числа от 1 до 10
# Напиши программу, которая выводит числа от 1 до 10 (включительно), используя:
# сначала for
# затем while
# for
for i in range(1, 11):
    print(i)
print("-" * 30)

# while
num = 1
while num <= 10:
    print(num)
    num += 1