import random
# Задача 3: Угадай число
# Реализуй игру «Угадай число»:

# Компьютер «загадывает» случайное число от 1 до 10
# (используй import random и random.randint(1, 10))
# Пользователь вводит число
# Программа говорит:
# "Больше!", если загаданное число больше
# "Меньше!", если меньше
# "Поздравляю! Вы угадали!", если угадал
# Игра продолжается, пока пользователь не угадает
# 💡 Используй while True + break 


# number = 6

# while number > 0:
#     number -= 1
#     if number == 2:
#         break
#     print(number)

# print("Loop ended")

random_num = random.randint(1, 10)
while True:
    user_num = input("Введите число от 1 до 10: ")

    if  not user_num.isdigit():
        print("Это не число")
        continue

    if int(user_num) < 1 or int(user_num) > 10:
        print("Число должно быть в диапазоне от 1 до 10")
        continue

    if int(user_num) >  random_num:
        print("Нет, число должно быть меньше")
    elif int(user_num) < random_num:
        print("Нет, число должно быть больше")
    else:
        print(f"Ты угадал! Это {user_num}")
        break
