#  Уровень 1: Основы — создание и чтение
# Задание 1. Список покупок 🛒
# Создай список shopping_list = ["молоко", "хлеб", "яйца"].

# Выведи второй элемент.
# Добавь в конец "бананы".
# Замени "хлеб" на "булку".
# Выведи длину списка.
# ✅ Цель: append, индексация, изменение, len()

shopping_list = ["молоко", "хлеб", "яйца"]
print(shopping_list[1])
shopping_list.append("бананы")
print(shopping_list)
shopping_list[1] = "булку"
print(shopping_list)
print(len(shopping_list))


# Задание 2. Оценки студента 📊
# Создай словарь:
student = {
    "name": "Мария",
    "math": 5,
    "physics": 4,
    "chemistry": 5
}
# Выведи имя студента.
# Выведи оценку по физике.
# Добавь новый предмет "biology": 3.
# Измени оценку по математике на 4.
# ✅ Цель: доступ по ключу, добавление/изменение

print(student["name"])
print(student["physics"])
student["biology"] = 3
print(student)
student["math"] = 4
print(student)


# Задание 3. Уникальные буквы ✨
# Дана строка: s = "абракадабра"
# Создай множество из её букв и выведи его.
# Сколько уникальных букв? (подсказка: len(...))

# ✅ Цель: set(), уникальность
s = "абракадабра"
# ← строка — итерируемая! set() сам разберёт на символы
unique_letters = set(s)
print(unique_letters)
print("Уникальных букв:", len(unique_letters))
