# Задача 2: Уникальные теги тестов 🏷️
# Даны два списка тегов:

# python
tags1 = ["smoke", "auth", "ui"]
tags2 = ["auth", "api", "regression", "ui"]
# Найди:
# Все уникальные теги (объединение)
# Общие теги (пересечение)
# Теги, которые есть в tags1, но не в tags2
# 💡 Преобразуй списки в множества: set(tags1)

set_tag1 = set(tags1)
set_tag2 = set(tags2)

unique_tags = set_tag1 | set_tag2
print(f"Все уникальные теги - {unique_tags}")

inters_tags = set_tag1 & set_tag2
print(f"Общие теги - {inters_tags}")

diff_tags = set_tag1 - set_tag2
print(f"Теги, которые есть в tags1, но не в tags2 - {diff_tags}")
