# Задача 3: Словарь студента 📚
# Создай словарь student с полями:

# "name" (строка)
# "grades" (список оценок, например: [4, 5, 4, 5])
# "group" (строка)
# Напиши код, который:

# считает средний балл
# выводит: "Студент [name] из группы [group] имеет средний балл: [avg]"
# 💡 Средний балл = sum(grades) / len(grades)
student = {"name": "Сергей",
           "grades": [1, 5, 3, 5, 7],
           "group": "5"}
avg = (sum(student["grades"])) / len(student["grades"])
print("Студент ", student["name"], " из группы ",
      student["group"], " имеет средний балл: ", avg)
